Revit 2027 API
gbXMLExportBuildingEnvelope Enumeration
 Indicates the determination method for the building envelope
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum gbXMLExportBuildingEnvelope
Public Enumeration gbXMLExportBuildingEnvelope
public enum class gbXMLExportBuildingEnvelope
type gbXMLExportBuildingEnvelope
Members
Member name | Value | Description
IdentifyExteriorElements | 1 |  This method uses a combination of ray-casting and flood-fill algorithms in order to identify the building elements that are exposed to the outside of the building, the building envelope. Analytical surface originated from the building elements in the envelope will be classified as exterior or shading surfaces.
UseFunctionParameter | 0 |  This method uses the Function type parameter of Walls, Floors and Building Pads to determinate the building elements considered to be part of the building envelope. If a wall has one adjacent space, analytical surface originated from the wall will be classified as exterior surfaces. If a wall has two adjacent spaces and its function is Exterior, Foundation, Retaining, or Soffit, analytical surface originated from the wall will be classified as interior surfaces. If thw wall's function is Interior or Core Shaft, analytical surface originated from the wall will be classfied interior surfaces, regardless of the number of adjacent spaces.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace